# Titanic

Desafio proposto no [Kaggle](https://www.kaggle.com/c/titanic/overview):
* Dispondo de uma base de dados dos passageiros do Titanic, criar um modelo capaz de prever pelas características da pessoa, se ela sobreviveu ou não ao desastre.

In [4]:
import pandas as pd
import numpy as np

In [25]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Remover dados que não serão importantes para o modelo, pois não têm impacto na possibilidade de sobrevivência, como o nome da pessoa e o número da passagem.

In [26]:
df = df.drop(['Name', 'Ticket', 'Cabin', 'Embarked'], axis=1)
df.set_index('PassengerId', inplace=True)

In [13]:
df.head()

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
1                   0       3    male  22.0      1      0   7.2500
2                   1       1  female  38.0      1      0  71.2833
3                   1       3  female  26.0      0      0   7.9250
4                   1       1  female  35.0      1      0  53.1000
5                   0       3    male  35.0      0      0   8.0500

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Age       714 non-null    float64
 2   SibSp     891 non-null    int64
 3   Parch     891 non-null    int64
 4   Fare      891 non-null    float64
 5   male      891 non-null    uint8
 6   Pclass_1  891 non-null    uint8
 7   Pclass_2  891 non-null    uint8
 8   Pclass_3  891 non-null    uint8
dtypes: float64(2), int64(3), uint8(4)
memory usage: 77.5 KB

Nas informações de idade, existem dados nulos. Para tratar os nulos, será usada a média das idades.

In [39]:
df['Age'].fillna(df['Age'].mean(), inplace=True)

Corrigir os dados categóricos, fazendo One Hot Enconding para as colunas `Sex` e `Pclass`:

In [27]:
df = pd.concat([df,pd.get_dummies(df.Sex, drop_first=True)], axis=1)

In [28]:
df = pd.concat([df,pd.get_dummies(df.Pclass, prefix='Pclass')], axis=1)

In [31]:
df.drop(['Sex','Pclass'], axis=1, inplace = True)

In [41]:
df.head()

,Survived,Age,SibSp,Parch,Fare,male,Pclass_1,Pclass_2,Pclass_3
PassengerId,,,,,,,,,
1,0,22.0,1,0,7.2500,1,0,0,1
2,1,38.0,1,0,71.2833,0,1,0,0
3,1,26.0,0,0,7.9250,0,0,0,1
4,1,35.0,1,0,53.1000,0,1,0,0
5,0,35.0,0,0,8.0500,1,0,0,1

In [42]:
from sklearn.model_selection import train_test_split

In [43]:
x_train, x_test, y_train, y_test = train_test_split(df.drop('Survived',axis=1),
                                                    df['Survived'],
                                                    test_size=0.3,
                                                    random_state=1999)

### Utilizando o RandomForestClassifier

In [46]:
from sklearn.ensemble import RandomForestClassifier

In [47]:
rdForest = RandomForestClassifier(n_estimators = 1000)

rdForest.fit(x_train, y_train)

RandomForestClassifier(n_estimators=1000)

In [69]:
prob = rdForest.predict_proba(df.drop('Survived', axis=1))[:,1]
prev = rdForest.predict(df.drop('Survived', axis=1))

In [70]:
df['Probabilidade']  = prob
df['Previsão_Survived'] = prev

In [72]:
df.head()

,Survived,Age,SibSp,Parch,Fare,male,Pclass_1,Pclass_2,Pclass_3,Probabilidade,Previsão_Survived
PassengerId,,,,,,,,,,,
1,0,22.0,1,0,7.2500,1,0,0,1,0.310,0
2,1,38.0,1,0,71.2833,0,1,0,0,0.999,1
3,1,26.0,0,0,7.9250,0,0,0,1,0.710,1
4,1,35.0,1,0,53.1000,0,1,0,0,0.991,1
5,0,35.0,0,0,8.0500,1,0,0,1,0.002,0

In [74]:
from sklearn.metrics import accuracy_score

In [75]:
accuracy_score(df['Survived'],df['Previsão_Survived'])

0.9371492704826038